InformationRegisters/ИдентификаторыВходящихСЭМД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ИдентификаторыВходящихСЭМД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИдентификаторСообщенияСЭМД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументыРЭМД</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСЭМД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыМДРегистрируемыхВРЭМД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ФедеральныеВебСервисыСообщенияРЭМД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ФедеральныеВебСервисыСообщенияРЭМД</Name>
			<Comment>Регистр необходимый для определения в ответ на что пришел асинхронный ответ от РЭМД</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОтвета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтвета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>emdrId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СообщениеУспешноОтправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИдентификаторыВходящихСЭМД/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС
#Область ПрограммныйИнтерфейс

Процедура ЗаписатьИдентификаторВходящегоСЭМД(ДокументСсылка, ТипСЭМД, ИдентификаторСообщенияСЭМД) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.Документ.Установить(ДокументСсылка);
	Набор.Отбор.Документ.Установить(ТипСЭМД);
	
	Запись = Набор.Добавить();
	Запись.Документ = ДокументСсылка;
	Запись.ТипСЭМД = ТипСЭМД;
	Запись.ИдентификаторСообщенияСЭМД = ИдентификаторСообщенияСЭМД;
	
	Набор.Записать();
	
КонецПроцедуры

Функция ПолучитьТекстВходящихСЭМД(ДокументСсылка, ТипСЭМД = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	ИдентификаторыВходящихСЭМД.ТипСЭМД             КАК ТипСЭМД,
	|	ФедеральныеВебСервисыСообщенияРЭМД.ПутьКФайлу  КАК ПутьКФайлу
	|ИЗ
	|	РегистрСведений.ИдентификаторыВходящихСЭМД КАК ИдентификаторыВходящихСЭМД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			РегистрСведений.ФедеральныеВебСервисыСообщенияРЭМД КАК ФедеральныеВебСервисыСообщенияРЭМД
	|		ПО
	|			ФедеральныеВебСервисыСообщенияРЭМД.ИдентификаторСообщения = ИдентификаторыВходящихСЭМД.ИдентификаторСообщенияСЭМД
	|ГДЕ
	|	ИдентификаторыВходящихСЭМД.Документ = &Документ
	|");
	
	Запрос.УстановитьПараметр("Документ", ДокументСсылка);
	
	Если ЗначениеЗаполнено(ТипСЭМД) Тогда
		
		// Добавление отбора по ТипСЭМД.
		
		СхемаЗапроса = Новый СхемаЗапроса;
		СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
		
		Отбор = СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор;
		Отбор.Добавить("ИдентификаторыВходящихСЭМД.ТипСЭМД = &ТипСЭМД");
		
		Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
		
		Запрос.УстановитьПараметр("ТипСЭМД", ТипСЭМД);
		
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.ТипСЭМД, ПолучитьСтрокуИзДвоичныхДанных(Новый ДвоичныеДанные(Выборка.ПутьКФайлу)));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
